zupcorp23012025.Расширение1/src/Documents/ВводДанныхПоАптеке/ВводДанныхПоАптеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхПоАптеке</name>
  <registerRecords>InformationRegister.ДанныеПоАптекам</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПоВыручке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактПоВыручкеПродавцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланПоМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроданоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВидыСтатусов</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроданоУпаковокОптика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРасчет</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядКатегория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядПодразделение</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабНомер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Минимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Максимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимумВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНочь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиВремяДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиВремяНочь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоБонусов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛичнаяВыручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаЛичнуюВыручку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛичнаяВыручкаПоДМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусПоДМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛичнаяВыручкаОптика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаОптику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланМУСреднечасовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактПродажМУЗаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактПродажМУЗаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажТоваровНаПродвижении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусМУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Среднечасовое1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Среднечасовое2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажСрокиИЗМЗ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусСроковые</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаОценку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСотрудника</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаСовмещение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уволенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальныйРасчетПоУволенным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КолПринятыхЗвонков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗвонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолСобранныхУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/ВводДанныхПоАптеке/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДанныеПоАптекам
	Движения.ДанныеПоАптекам.Записывать = Истина;
	//Если ПланПоВыручке=ТЧРасчет.Итог("ЛичнаяВыручка")+ТЧРасчет.Итог("ЛичнаяВыручкаПоДМ") тогда
		Для Каждого ТекСтрокаТЧРасчет Из ТЧРасчет Цикл 
			Если ТекСтрокаТЧРасчет.Уволенная=Ложь тогда 
				Движение = Движения.ДанныеПоАптекам.Добавить();
				Движение.Статус = Статус;
				Движение.Подразделение = ТекСтрокаТЧРасчет.ПодразделениеСотрудника;
				Движение.Должность = ТекСтрокаТЧРасчет.Должность;
				Движение.РазрядКатегория = ТекСтрокаТЧРасчет.РазрядКатегория;
				Движение.РазрядПодразделение = ТекСтрокаТЧРасчет.РазрядПодразделение;
				Движение.ПодразделениеРаботы = Подразделение;
				Движение.Сотрудник = ТекСтрокаТЧРасчет.Сотрудник;
				Движение.ФизическоеЛицо = ТекСтрокаТЧРасчет.ФизическоеЛицо;
				Движение.ДатаПо = ДатаПо;
				Движение.ДатаС = ДатаС;
				Движение.ВремяДень = ТекСтрокаТЧРасчет.ВремяДень;
				Движение.ВремяНочь = ТекСтрокаТЧРасчет.ВремяНочь;
				Движение.ПраздникиВремяДень=ТекСтрокаТЧРасчет.ПраздникиВремяДень;
				Движение.ПраздникиВремяНочь=ТекСтрокаТЧРасчет.ПраздникиВремяНочь;
				//Движение.БонусЗаОценку = ТекСтрокаТЧРасчет.БонусЗаОценку;
				Движение.БонусСроковые = ТекСтрокаТЧРасчет.БонусСроковые;
				Движение.БонусМУ = ТекСтрокаТЧРасчет.БонусМУ;
				Движение.БонусПоДМ = ТекСтрокаТЧРасчет.БонусПоДМ;                      
				Движение.БонусЗаСовмещение = ТекСтрокаТЧРасчет.БонусЗаСовмещение;
				Движение.ЛичнаяВыручкаДТМ=ТекСтрокаТЧРасчет.ЛичнаяВыручкаПоДМ;
				Движение.ЛичнаяВыручкаНеДТМ=ТекСтрокаТЧРасчет.ЛичнаяВыручка;
				Движение.БонусЗаЛичнуюВыручку = ТекСтрокаТЧРасчет.БонусЗаЛичнуюВыручку;
				//Движение.ПланМУСреднечасовой=ТекСтрокаТЧРасчет.ПланМУСреднечасовой;
				//Движение.ФактПродажМУЗаЧас=ТекСтрокаТЧРасчет.ФактПродажМУЗаЧас;
				Движение.ФактПродажМУЗаМесяц=ТекСтрокаТЧРасчет.ФактПродажМУЗаМесяц;
				Движение.СуммаПродажТоваровНаПродвижении=ТекСтрокаТЧРасчет.СуммаПродажТоваровНаПродвижении;
				//Движение.ОценкаТекст=ТекСтрокаТЧРасчет.Оценка;
				
				//Движение.Среднечасовое1 = ТекСтрокаТЧРасчет.Среднечасовое1; 
				//Движение.Среднечасовое2=ТекСтрокаТЧРасчет.Среднечасовое2;
				Движение.КоличествоУпаковок=ТекСтрокаТЧРасчет.КоличествоУпаковок;
				Движение.СуммаПродажСрокиИЗМЗ=ТекСтрокаТЧРасчет.СуммаПродажСрокиИЗМЗ;
				Движение.ЛичнаяВыручкаОптика=ТекСтрокаТЧРасчет.ЛичнаяВыручкаОптика;
				Движение.БонусЗаОптику=ТекСтрокаТЧРасчет.БонусЗаОптику;
				
				Движение.КолПринятыхЗвонков=ТекСтрокаТЧРасчет.КолПринятыхЗвонков;
				Движение.БонусЗвонки=ТекСтрокаТЧРасчет.БонусЗвонки;
				Движение.КолСобранныхУпаковок=ТекСтрокаТЧРасчет.КолСобранныхУпаковок;
				Движение.БонусСтрокиЗаказов=ТекСтрокаТЧРасчет.БонусУпаковки;
				
				Если ТекСтрокаТЧРасчет.ПервоначальныйРасчетПоУволенным=Истина тогда
					Движение.Уволенная=истина;
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;
	//иначе 
	//	Сообщить("Фактическая выручка превышает значение сумм по личной выручке");
	//	Отказ=истина;
	//конецесли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
